dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_sensing.h
/***************************************************************************//**
* \file cy_capsense_sensing.h
* \version 1.0
*
* \brief
* This file provides the function prototypes specific to the sensing module.
*
********************************************************************************
* \copyright
* Copyright 2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CAPSENSE_SENSING_H)
#define CY_CAPSENSE_SENSING_H

#include "cy_gpio.h"
#include "cy_syslib.h"
#include "cy_sysclk.h"
#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \addtogroup group_capsense_high_level *//** \{ */
/******************************************************************************/

cy_status Cy_CapSense_SetupWidget(uint32_t widgetId, cy_stc_capsense_context_t * context);
cy_status Cy_CapSense_Scan(cy_stc_capsense_context_t * context);
cy_status Cy_CapSense_ScanAllWidgets(cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_IsBusy(const cy_stc_capsense_context_t * context);
void Cy_CapSense_InterruptHandler(const CSD_Type * base, cy_stc_capsense_context_t * context);

/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_low_level *//** \{ */
/******************************************************************************/

cy_status Cy_CapSense_SetPinState(uint32_t widgetId, uint32_t sensorElement, uint32_t state, cy_stc_capsense_context_t * context);

cy_status Cy_CapSense_CalibrateWidget(uint32_t widgetId, cy_stc_capsense_context_t * context);
cy_status Cy_CapSense_CalibrateAllWidgets(cy_stc_capsense_context_t * context);
cy_status Cy_CapSense_CalibrateAllCsdWidgets(cy_stc_capsense_context_t * context);
cy_status Cy_CapSense_CalibrateAllCsxWidgets(cy_stc_capsense_context_t * context);

/** \} */

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

void Cy_CapSense_SetBusyFlags(cy_stc_capsense_context_t * context);
void Cy_CapSense_ClrBusyFlags(cy_stc_capsense_context_t * context);
cy_status Cy_CapSense_SsInitialize(cy_stc_capsense_context_t * context);
void Cy_CapSense_SsPostAllWidgetsScan(cy_stc_capsense_context_t * context);
void Cy_CapSense_SetIOsInDefaultState(const cy_stc_capsense_context_t * context);
void Cy_CapSense_SetSpecificIOsInDefaultState(const cy_stc_capsense_context_t * context);



void Cy_CapSense_SwitchSensingMode(uint8_t mode, cy_stc_capsense_context_t * context);

cy_status Cy_CapSense_SsAutoTune(cy_stc_capsense_context_t * context);
cy_status Cy_CapSense_SsAutoTuneWidget(uint32_t widgetId, cy_stc_capsense_context_t * context);

void Cy_CapSense_InitializeSourceSenseClk(const cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_SsCalcLfsrSize(uint32_t clkDivider, uint32_t conversionsNum);

void Cy_CapSense_DischargeExtCapacitors(cy_stc_capsense_context_t * context);

void Cy_CapSense_InitActivePtrSns(uint32_t sensorId, cy_stc_capsense_context_t * context);
void Cy_CapSense_InitActivePtrWd(uint32_t widgetId, cy_stc_capsense_context_t * context);
void Cy_CapSense_InitActivePtr(uint32_t widgetId, uint32_t sensorId, cy_stc_capsense_context_t * context);

void Cy_CapSense_SsConfigPinRegisters(GPIO_PRT_Type * base, uint32_t pinNum, uint32_t dm, en_hsiom_sel_t hsiom);
void Cy_CapSense_SsReadPinRegisters(GPIO_PRT_Type * base, uint32_t pinNum, uint32_t *dm, en_hsiom_sel_t *hsiom);

void Cy_CapSense_SetClkDivider(uint32_t dividerValue, const cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_WatchdogCyclesNum(uint32_t desiredTimeUs, uint32_t cpuFreqMHz, uint32_t cyclesPerLoop);

cy_status Cy_CapSense_CalibrateCheck(uint32_t widgetId, uint32_t target, uint32_t senseMethod,
                                                                    const cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_GetVrefAutoMv(uint32_t vddaMv);
uint32_t Cy_CapSense_GetVrefHighGain(uint32_t vddaMv, uint32_t vrefInputMv, uint32_t vrefDesiredMv);
uint32_t Cy_CapSense_GetVrefHighMv(uint32_t vrefInputMv, uint32_t vrefGain);
cy_status Cy_CapSense_InternalPreCalculation(cy_stc_capsense_context_t * context);

/** \} \endcond */


/*******************************************************************************
* Local definition
*******************************************************************************/

/*
 *  Definition of the default configuration of the CSD HW registers that is
 *  intended to be used on the CSD HW capturing stage.
 *  The configuration includes:
 *  1. Start of the analog settling process:
 *      - Enables the CSD HW block;
 *      - Enables all the CSD HW sub blocks (AMBUF, REFGEN, CSDCMP, HSCMP);
 *      - Enables the Sense Modulator output;
 *  2. Clear all of the pending CSD HW interrupt requests (SAMPLE, INIT, ADC_RES);
 *  3. Sets into default state the rest CSD HW options which are not related
 *     to actions #1 and #2.
*/
#define CY_CAPSENSE_CSD_CONFIG_DEFAULT  {\
    .config         = 0x84001000uL, /* ENABLE = "1", SENSE_EN = "1". Set other fields into default state. */\
    .spare          = 0x00000000uL, /* Set all fields into default state. */                                \
    .status         = 0x00000000uL, /* Set all fields into default state. */                                \
    .statSeq        = 0x00000000uL, /* Set all fields into default state. */                                \
    .statCnts       = 0x00000000uL, /* Set all fields into default state. */                                \
    .statHcnt       = 0x00000000uL, /* Set all fields into default state. */                                \
    .resultVal1     = 0x00000000uL, /* Set all fields into default state. */                                \
    .resultVal2     = 0x00000000uL, /* Set all fields into default state. */                                \
    .adcRes         = 0x00000000uL, /* Set all fields into default state. */                                \
    .intr           = 0x00000106uL, /* SAMPLE = "1", INIT = "1", ADC_RES = "1". */                          \
    .intrSet        = 0x00000000uL, /* Set all fields into default state. */                                \
    .intrMask       = 0x00000000uL, /* Set all fields into default state. */                                \
    .intrMasked     = 0x00000000uL, /* Set all fields into default state. */                                \
    .hscmp          = 0x00000001uL, /* HSCMP_EN  = "1". Set all other fields into default state. */         \
    .ambuf          = 0x00000001uL, /* PWR_MODE  = "1". Set all other fields into default state. */         \
    .refgen         = 0x00000001uL, /* REFGEN_EN = "1". Set all other fields into default state. */         \
    .csdCmp         = 0x00000001uL, /* CSDCMP_EN = "1". Set all other fields into default state. */         \
    .swRes          = 0x00000000uL, /* Set all fields into default state. */                                \
    .sensePeriod    = 0x0C000000uL, /* Set all fields into default state. */                                \
    .senseDuty      = 0x00000000uL, /* Set all fields into default state. */                                \
    .swHsPosSel     = 0x00000000uL, /* Set all fields into default state. */                                \
    .swHsNegSel     = 0x00000000uL, /* Set all fields into default state. */                                \
    .swShieldSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swAmuxbufSel   = 0x00000000uL, /* Set all fields into default state. */                                \
    .swBypSel       = 0x00000000uL, /* Set all fields into default state. */                                \
    .swCmpPosSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swCmpNegSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swRefgenSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swFwModSel     = 0x00000000uL, /* Set all fields into default state. */                                \
    .swFwTankSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swDsiSel       = 0x00000000uL, /* Set all fields into default state. */                                \
    .ioSel          = 0x00000000uL, /* Set all fields into default state. */                                \
    .seqTime        = 0x00000000uL, /* Set all fields into default state. */                                \
    .seqInitCnt     = 0x00000000uL, /* Set all fields into default state. */                                \
    .seqNormCnt     = 0x00000000uL, /* Set all fields into default state. */                                \
    .adcCtl         = 0x00000000uL, /* Set all fields into default state. */                                \
    .seqStart       = 0x00000000uL, /* Set all fields into default state. */                                \
    .idacA          = 0x00000000uL, /* Set all fields into default state. */                                \
    .idacB          = 0x00000000uL, /* Set all fields into default state. */                                \
    }

extern const cy_stc_csd_config_t cy_capsense_csdCfg;


