dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_sensing.h
/*******************************************************************************
* PRS & LFSR masks
*******************************************************************************/
#define CY_CAPSENSE_PRS_LENGTH_8_BITS                           (0x000000FFuL)
#define CY_CAPSENSE_PRS_LENGTH_12_BITS                          (0x00000FFFuL)

#define CY_CAPSENSE_SNSCLK_SSC1_PERIOD                          (63u)
#define CY_CAPSENSE_SNSCLK_SSC2_PERIOD                          (127u)
#define CY_CAPSENSE_SNSCLK_SSC3_PERIOD                          (511u)
#define CY_CAPSENSE_SNSCLK_SSC4_PERIOD                          (1023u)

#define CY_CAPSENSE_SNSCLK_LFSR_RANGE                           (16u)
#define CY_CAPSENSE_LFSR_DITHER_PERCENTAGE                      (10uL)
#define CY_CAPSENSE_SNSCLK_LFSR_THRESHOLD                       (CY_CAPSENSE_LFSR_DITHER_PERCENTAGE * CY_CAPSENSE_SNSCLK_LFSR_RANGE)

/*******************************************************************************
* HSIOM Macros redefinition for readability
*******************************************************************************/
#define CY_CAPSENSE_HSIOM_SEL_GPIO                              (HSIOM_SEL_GPIO)
#define CY_CAPSENSE_HSIOM_SEL_CSD_SENSE                         (HSIOM_SEL_ACT_3)
#define CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD                        (HSIOM_SEL_ACT_2)
#define CY_CAPSENSE_HSIOM_SEL_AMUXA                             (HSIOM_SEL_AMUXA)
#define CY_CAPSENSE_HSIOM_SEL_AMUXB                             (HSIOM_SEL_AMUXB)

/*******************************************************************************
* Clock Macros
*******************************************************************************/
#define CY_CAPSENSE_MODCLK_CMD_DIV_SHIFT                        (0uL)
#define CY_CAPSENSE_MODCLK_CMD_PA_DIV_SHIFT                     (8uL)
#define CY_CAPSENSE_MODCLK_CMD_DISABLE_SHIFT                    (30uL)
#define CY_CAPSENSE_MODCLK_CMD_ENABLE_SHIFT                     (31uL)
#define CY_CAPSENSE_MODCLK_CMD_DISABLE_MASK                     ((uint32_t)(1uL << CY_CAPSENSE_MODCLK_CMD_DISABLE_SHIFT))
#define CY_CAPSENSE_MODCLK_CMD_ENABLE_MASK                      ((uint32_t)(1uL << CY_CAPSENSE_MODCLK_CMD_ENABLE_SHIFT))

#define CY_CAPSENSE_MOD_CSD_CLK_12000000_HZ                     (12000000uL)
#define CY_CAPSENSE_MOD_CSD_CLK_24000000_HZ                     (24000000uL)
#define CY_CAPSENSE_MOD_CSD_CLK_48000000_HZ                     (48000000uL)

#define CY_CAPSENSE_MIN_SNS_CLK_DIVIDER                         (4000u)

#define CY_CAPSENSE_PERI_CLK_KHZ                                (50000000U / 1000U)
#define CY_CAPSENSE_PERI_CLK_MHZ                                (CY_CAPSENSE_PERI_CLK_KHZ / 1000U)
    
#define CY_CAPSENSE_CPU_CLK_KHZ                                 (50000000U / 1000U)
#define CY_CAPSENSE_CPU_CLK_MHZ                                 (CY_CAPSENSE_CPU_CLK_KHZ / 1000U)

/*******************************************************************************
* Miscellaneous Macros
*******************************************************************************/
#define CY_CAPSENSE_2000_MV                                     (2000u)

#if defined(__cplusplus)
}
#endif

#endif /* CY_CAPSENSE_SENSING_H */


/* [] END OF FILE */
